# Pandas

## Basic Pandas

In [1]:
import pandas as pd

In [ ]:
df = pd.read_csv("../data/student_data.csv")
print(df)

   StudentID          FullName  Data Structure Marks  Algorithm Marks  \
0     PH1001       Alif Rahman                  85.0             85.0
1     PH1002     Fatima Akhter                  92.0             92.0
2     PH1003     Imran Hossain                  88.0             88.0
3     PH1004  Jannatul Ferdous                  78.0             78.0
4     PH1005       Kamal Uddin                   NaN              NaN
5     PH1006       Laila Begum                  75.0             75.0
6     PH1007    Mahmudul Hasan                  80.0             80.0
7     PH1008       Nadia Islam                  81.0             81.0
8     PH1009        Omar Faruq                  72.0             72.0
9     PH1010      Priya Sharma                  89.0             89.0
10    PH1011      Rahim Sheikh                   NaN              NaN
11    PH1012   Sadia Chowdhury                  85.0             85.0
12    PH1013      Tanvir Ahmed                  75.0             75.0
13    PH1014        Urmi Akter                   NaN              NaN
14    PH1015      Wahiduzzaman                  86.0             86.0
15    PH1016      Ziaur Rahman                  94.0             94.0
16    PH1017       Afsana Mimi                  90.0             90.0
17    PH1018       Babul Ahmed                  88.0             88.0
18    PH1019      Faria Rahman                   NaN              NaN
19    PH1020        Nasir Khan                  86.0             86.0
20       NaN               NaN                   NaN              NaN

    Python Marks CompletionStatus EnrollmentDate Instructor    Location
0           88.0        Completed     2024-01-15  Mr. Karim       Dhaka
1            NaN      In Progress     2024-01-20  Ms. Salma  Chattogram
2           85.0        Completed     2024-02-10  Mr. Karim       Dhaka
3           82.0        Completed     2024-02-12  Ms. Salma      Sylhet
4           95.0      In Progress     2024-03-05  Mr. Karim  Chattogram
5           78.0        Completed     2024-03-08  Ms. Salma    Rajshahi
6            NaN      In Progress     2024-04-01  Mr. Karim       Dhaka
7           85.0        Completed     2024-04-22  Ms. Salma  Chattogram
8           76.0        Completed     2024-05-16  Mr. David       Dhaka
9           88.0        Completed     2024-05-20  Ms. Salma      Sylhet
10          91.0      In Progress     2024-06-11  Mr. Karim      Khulna
11          87.0        Completed     2024-06-14  Ms. Salma  Chattogram
12          79.0        Completed     2024-07-02  Mr. David       Dhaka
13           NaN      Not Started     2024-07-09  Ms. Salma    Rajshahi
14          84.0        Completed     2024-08-18  Mr. Karim       Dhaka
15           NaN      In Progress     2024-08-21  Ms. Salma  Chattogram
16          93.0        Completed     2025-09-01  Mr. Karim       Dhaka
17          85.0        Completed     2025-09-05  Ms. Salma      Sylhet
18           NaN      Not Started     2025-09-15  Mr. David  Chattogram
19          89.0        Completed     2025-10-02  Ms. Salma       Dhaka
20           NaN              NaN            NaN        NaN         NaN

In [3]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [ ]:
student_id = df["StudentID"]

print(student_id)

print(type(student_id))

0     PH1001
1     PH1002
2     PH1003
3     PH1004
4     PH1005
5     PH1006
6     PH1007
7     PH1008
8     PH1009
9     PH1010
10    PH1011
11    PH1012
12    PH1013
13    PH1014
14    PH1015
15    PH1016
16    PH1017
17    PH1018
18    PH1019
19    PH1020
20       NaN
Name: StudentID, dtype: object
<class 'pandas.core.series.Series'>

## Pandas Basic Funtionalities

### Head Function in Pandas

In [20]:
# head function
default_head_value = df.head()
three_head_value = df.head(3)
print("Dafault value in head\n")
print(default_head_value)
print("\n")
print("Three value in head\n")
print(three_head_value)

Dafault value in head

  StudentID          FullName  Data Structure Marks  Algorithm Marks  \
0    PH1001       Alif Rahman                  85.0             85.0
1    PH1002     Fatima Akhter                  92.0             92.0
2    PH1003     Imran Hossain                  88.0             88.0
3    PH1004  Jannatul Ferdous                  78.0             78.0
4    PH1005       Kamal Uddin                   NaN              NaN

   Python Marks CompletionStatus EnrollmentDate Instructor    Location
0          88.0        Completed     2024-01-15  Mr. Karim       Dhaka
1           NaN      In Progress     2024-01-20  Ms. Salma  Chattogram
2          85.0        Completed     2024-02-10  Mr. Karim       Dhaka
3          82.0        Completed     2024-02-12  Ms. Salma      Sylhet
4          95.0      In Progress     2024-03-05  Mr. Karim  Chattogram


Three value in head

  StudentID       FullName  Data Structure Marks  Algorithm Marks  \
0    PH1001    Alif Rahman                  85.0             85.0
1    PH1002  Fatima Akhter                  92.0             92.0
2    PH1003  Imran Hossain                  88.0             88.0

   Python Marks CompletionStatus EnrollmentDate Instructor    Location
0          88.0        Completed     2024-01-15  Mr. Karim       Dhaka
1           NaN      In Progress     2024-01-20  Ms. Salma  Chattogram
2          85.0        Completed     2024-02-10  Mr. Karim       Dhaka

### Tail Function in Pandas

In [22]:
# tail function
default_tail_value = df.tail()
three_tail_value = df.tail(3)
print("Dafault value in tail\n")
print(default_tail_value)
print("\n")
print("Three value in tail\n")
print(three_tail_value)

Dafault value in tail

   StudentID      FullName  Data Structure Marks  Algorithm Marks  \
16    PH1017   Afsana Mimi                  90.0             90.0
17    PH1018   Babul Ahmed                  88.0             88.0
18    PH1019  Faria Rahman                   NaN              NaN
19    PH1020    Nasir Khan                  86.0             86.0
20       NaN           NaN                   NaN              NaN

    Python Marks CompletionStatus EnrollmentDate Instructor    Location
16          93.0        Completed     2025-09-01  Mr. Karim       Dhaka
17          85.0        Completed     2025-09-05  Ms. Salma      Sylhet
18           NaN      Not Started     2025-09-15  Mr. David  Chattogram
19          89.0        Completed     2025-10-02  Ms. Salma       Dhaka
20           NaN              NaN            NaN        NaN         NaN


Three value in tail

   StudentID      FullName  Data Structure Marks  Algorithm Marks  \
18    PH1019  Faria Rahman                   NaN              NaN
19    PH1020    Nasir Khan                  86.0             86.0
20       NaN           NaN                   NaN              NaN

    Python Marks CompletionStatus EnrollmentDate Instructor    Location
18           NaN      Not Started     2025-09-15  Mr. David  Chattogram
19          89.0        Completed     2025-10-02  Ms. Salma       Dhaka
20           NaN              NaN            NaN        NaN         NaN

### Columns Function in Pandas to get columns of data

In [ ]:
# column
import numpy as np

df.columns
col = np.array(df.columns)
print("All columns of csv\n")
print(f"{col}\n")
print("Columns type of csv\n")
print(col.dtype)

All columns of csv

['StudentID' 'FullName' 'Data Structure Marks' 'Algorithm Marks'
 'Python Marks' 'CompletionStatus' 'EnrollmentDate' 'Instructor'
 'Location']

Columns type of csv

object

### Index Function in Pandas to get index of data

In [31]:
# index
ind = np.array(df.index)
print("All index of csv \n")
print(ind)

All index of csv

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

### Basic Function

In [ ]:
# info
print("Info function to get info of data src file \n")
print(df.info())
print("\n")

# sample
print("Get some default random sample of data \n")
print(df.sample())
print("\n")

# statistical values
print("Get statistical values of data \n")
print(df.describe())
print("\n")

Info function to get info of data src file

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   StudentID             20 non-null     object
 1   FullName              20 non-null     object
 2   Data Structure Marks  16 non-null     float64
 3   Algorithm Marks       16 non-null     float64
 4   Python Marks          15 non-null     float64
 5   CompletionStatus      20 non-null     object
 6   EnrollmentDate        20 non-null     object
 7   Instructor            20 non-null     object
 8   Location              20 non-null     object
dtypes: float64(3), object(6)
memory usage: 1.6+ KB
None


Get some default random sample of data

   StudentID      FullName  Data Structure Marks  Algorithm Marks  \
15    PH1016  Ziaur Rahman                  94.0             94.0

    Python Marks CompletionStatus EnrollmentDate Instructor    Location
15           NaN      In Progress     2024-08-21  Ms. Salma  Chattogram


Get statistical values of data

       Data Structure Marks  Algorithm Marks  Python Marks
count             16.000000        16.000000     15.000000
mean              84.000000        84.000000     85.666667
std                6.501282         6.501282      5.394000
min               72.000000        72.000000     76.000000
25%               79.500000        79.500000     83.000000
50%               85.500000        85.500000     85.000000
75%               88.250000        88.250000     88.500000
max               94.000000        94.000000     95.000000

## Transforming to df from inbuilt datas

### List Data

In [ ]:
my_list = [["Alice", 25], ["Bob", 30], ["Charlie", 28]]

list_df = pd.DataFrame(my_list, columns=["Name", "Age"], index=[1, 2, 3])

print("Get Data Frame from a List \n")
list_df

Get Data Frame from a List

      Name  Age
1    Alice   25
2      Bob   30
3  Charlie   28

### Tuple Data

In [ ]:
my_tuple = (("Alice", 25), ("Bob", 30), ("Charlie", 28))

tuple_df = pd.DataFrame(my_tuple, columns=["Name", "Age"])
print("Get Data Frame from a Tuple \n")
tuple_df

Get Data Frame from a Tuple

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

### Dictionary Data

In [ ]:
my_dict = {"Name": ["Alice", "Bob", "Charlie"], "Age": [25, 29, 28]}

dict_df = pd.DataFrame(my_dict)
print("Get Data Frame from a Dictionary \n")
dict_df

Get Data Frame from a Dictionary

      Name  Age
0    Alice   25
1      Bob   29
2  Charlie   28

### JSON Data

In [ ]:
json_data = [
    {"Name": "Alice", "Age": 25, "City": "New York"},
    {"Name": "Bob", "Age": 30, "City": "Paris"},
    {"Name": "Charlie", "Age": 28, "City": "Rajshahi"},
]

data_df = pd.DataFrame(json_data)
print("Get Data Frame from a JSON \n")
data_df

Get Data Frame from a JSON

      Name  Age      City
0    Alice   25  New York
1      Bob   30     Paris
2  Charlie   28  Rajshahi

## Accessing values from DF

### pandas.DataFrame.loc Function

In [ ]:
# df.loc[ind start:ind end,col_start,col_end]
print("Accessing values from DF using loc \n")
df.loc[[2, 3, 19]]

Accessing values from DF using loc

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka